app/views/posts/edit.html.erb


    <p><%= m.collection_select :language_id, Language.all, :id, :lang_name %></p>
---
SELECT `languages`.* FROM `languages`