app/views/posts/new.html.erb


                <p>言語名:<%= m.collection_select :language_id, Language.all, :id, :lang_name %></p><br>
---
SELECT `languages`.* FROM `languages`