app/controllers/languages_controller.rb

INSERT INTO `languages` (`lang_name`, `created_at`, `updated_at`) VALUES ('HTML', '2019-09-07 10:07:31', '2019-09-07 10:07:31')
---
  def create
    language = Language.new(language_params)
    language.save