app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2
---
  def index
    @posts = current_user.posts.all

INSERT INTO `posts` (`title`, `body`, `language_id`, `user_id`, `created_at`, `updated_at`) VALUES ('zz', 'xx', 1, 1, '2019-09-08 06:00:45', '2019-09-08 06:00:45')
---
  def create
    post = Post.new(post_params)

    post.user_id = current_user.id

    post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 30 LIMIT 1
UPDATE `posts` SET `updated_at` = '2019-09-08 11:12:39', `body` = '全部消しますaaa' WHERE `posts`.`id` = 6
---
  def update
    post = Post.find(params[:id])
      if params[:post][:check] == nil
      else
        params[:post][:check].each do |image_id|
          image = post.images.find(image_id)
          image.purge
        end
      end
    post.update(post_params)