app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 4
---
  def destroy
    post = Post.find(params[:id])
    post.destroy