app/controllers/timers_controller.rb

INSERT INTO `timers` (`user_id`, `created_at`, `updated_at`) VALUES (1, '2019-09-10 11:22:28', '2019-09-10 11:22:28')
---
    def create
        timer = Timer.new
        timer.user_id = current_user.id
        timer.save

SELECT  `timers`.* FROM `timers` WHERE `timers`.`id` = 18 LIMIT 1
---
    def show
        @timer = Timer.find(params[:id])

SELECT  `timers`.* FROM `timers` WHERE `timers`.`id` = 18 LIMIT 1
---
    def update
        timer = Timer.find(params[:id])