app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @posts = current_user.posts.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `updated_at` = '2019-09-09 02:06:02' WHERE `users`.`id` = 2
---
  def update
    user = User.find(params[:id])
    user.update(user_params)