app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = current_user.posts.page(params[:page]).reverse_order

    # time関連の記述
    @timer = Timer.new

    @timers = current_user.timers.all
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 2 LIMIT 11
SELECT  `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 LIMIT 11